FirstRoutes/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index
        artworks = Artwork.all

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "title1"], ["img_url", "url1"], ["artist_id", 1], ["created_at", "2023-06-08 15:54:09.211106"], ["updated_at", "2023-06-08 15:54:09.211106"]]
---
    def create
        # debugger
        artwork = Artwork.new(artwork_params)
        if artwork.save

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "img_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "title5"], ["img_url", "url5"], ["artist_id", 2], ["updated_at", "2023-06-08 15:57:28.639957"], ["id", 4]]
---
    def update
        artwork =  Artwork.find(params[:id])
        if artwork.update(artwork_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 4]]
---
    def destroy
        artwork = Artwork.find(params[:id])
        artwork.destroy