FirstRoutes/app/controllers/artwork_shares_controller.rb

    def index
        artwork_shares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

    def create
        artwork_share = ArtworkShare.new(artwork_share_params)
        if artwork_share.save
---
INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["viewer_id", 1], ["artwork_id", 2], ["created_at", "2023-06-08 19:12:36.602733"], ["updated_at", "2023-06-08 19:12:36.602733"]]

    def destroy
        artwork_share = ArtworkShare.destroy(params[:id])
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]