FirstRoutes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sammy"], ["email", nil], ["created_at", "2023-06-07 20:57:09.458191"], ["updated_at", "2023-06-07 20:57:09.458191"]]
---
    def create
        # debugger
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Dylan"], ["email", "dylan@gmail.com"], ["updated_at", "2023-06-07 21:15:07.692260"], ["id", 7]]
---
    def update
        user = User.find(params[:id])
        if user.update(user_params)